; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	thermograph2 - mode
	image1 - mode
	thermograph0 - mode
	image4 - mode
	thermograph3 - mode
	Star0 - direction
	GroundStation3 - direction
	Star4 - direction
	GroundStation9 - direction
	Star5 - direction
	GroundStation2 - direction
	Star6 - direction
	Star7 - direction
	GroundStation1 - direction
	Star8 - direction
	Star10 - direction
	Planet11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 image4)
	(supports instrument0 thermograph3)
	(supports instrument0 image1)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 Star5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 Star7)
	(calibration_target instrument1 Star8)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet14)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 Star8)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet11)
	(supports instrument3 image4)
	(calibration_target instrument3 Star8)
	(calibration_target instrument3 GroundStation1)
	(on_board instrument3 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation9)
)
(:goal (and
	(pointing satellite2 Phenomenon13)
	(have_image Star10 thermograph2)
	(have_image Planet11 thermograph2)
	(have_image Planet12 thermograph2)
	(have_image Phenomenon13 thermograph3)
	(have_image Planet14 image4)
))

)

; plan
1. (turn_to satellite2 star8 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 star8)
   goals met: 0 of 6
2. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 0 of 6
3. (calibrate satellite2 instrument2 star8)
   added: (calibrated instrument2)
   goals met: 0 of 6
4. (turn_to satellite2 planet11 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 planet11)
   goals met: 0 of 6
5. (turn_to satellite0 groundstation2 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 6
6. (take_image satellite2 planet11 instrument2 thermograph2)
   added: (have_image planet11 thermograph2)
   goals met: 1 of 6
7. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 6
8. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 1 of 6
9. (turn_to satellite0 phenomenon13 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon13)
   goals met: 1 of 6
10. (take_image satellite0 phenomenon13 instrument0 thermograph3)
   added: (have_image phenomenon13 thermograph3)
   goals met: 2 of 6
11. (turn_to satellite0 planet14 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 planet14)
   goals met: 2 of 6
12. (take_image satellite0 planet14 instrument0 image4)
   added: (have_image planet14 image4)
   goals met: 3 of 6
13. (turn_to satellite2 planet12 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 planet12)
   goals met: 3 of 6
14. (take_image satellite2 planet12 instrument2 thermograph2)
   added: (have_image planet12 thermograph2)
   goals met: 4 of 6
15. (turn_to satellite2 star10 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 star10)
   goals met: 4 of 6
16. (take_image satellite2 star10 instrument2 thermograph2)
   added: (have_image star10 thermograph2)
   goals met: 5 of 6
17. (turn_to satellite2 phenomenon13 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 phenomenon13)
   goals met: 6 of 6
